Delans-TLE/src/InformationRegisters/ES_ГородаОбслуживания/ES_ГородаОбслуживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ES_ГородаОбслуживания</name>
  <resources>
    <name>Терминал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Зона</name>
    <type>
      <types>CatalogRef.ES_ВнутрирегиональнаяЗона</types>
    </type>
  </resources>
  <dimensions>
    <name>НасленныйПункт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Delans-TLE/src/InformationRegisters/ES_ГородаОбслуживания/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ЗагрузитьНаСервере(АдресФайлаДанных,Розширение)
	
	
	мФайл = ПолучитьИзВременногоХранилища(АдресФайлаДанных);
	Имя = ПолучитьИмяВременногоФайла("."+Розширение);
	мФайл.Записать(Имя);
	
	ЗагрузкаЛинукс = Истина;
	
	Если НЕ ЗагрузкаЛинукс Тогда
		Попытка 	
			Excel = новый COMОбъект("Excel.Application");
			Док = Excel.Workbooks.Open(Имя);
		Исключение
			Сообщить("Не удалось открыть прочитать файл");
			Возврат;
		КонецПопытки;
		
		Лист = Док.Worksheets(2);
		//Лист.Unprotect(); 
		КоличествоСтрокЭкселе = Лист.UsedRange.Rows.Count;
		
		ТЗ = ПрочитатьЛистExcel(,Лист,29,1,КоличествоСтрокЭкселе,9);
		Excel = Неопределено;
	Иначе
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.Прочитать(Имя,СпособЧтенияЗначенийТабличногоДокумента.Текст);
		
		КоличествоСтрок = ТабДок.ВысотаТаблицы;
		
		//ТабДок.Показать();
		//мСтруктура.ТабДок = ТабДок;
		
		ТЗ = ПрочитатьТабличныйДокумент(,ТабДок,8,2,КоличествоСтрок,14);
		
	КонецЕсли;
	
	ТЗ.Свернуть("ОбслуживаемыйНаселенныйПункт,Регион_республика_Край_Область_, ГлобальныйТерминал_ТерминалПриписки_тюковки_, ВнутрирегиональнаяЗона");
	
	/////Очищать
	
	Набор = РегистрыСведений.ES_ГородаОбслуживания.СоздатьНаборЗаписей();
	Набор.Прочитать();  
	Набор.Очистить();
	ИтерСооб = 13;	
	Для итер = 2 по ТЗ.количество()-1 Цикл	
		ИтерСооб = ИтерСооб+1;
		СтрокаЗона = ТЗ[итер].ВнутрирегиональнаяЗона;  		
		Если ПустаяСтрока(СтрокаЗона) Тогда 
			//создаем зону 				
			//Зона = Справочники.ES_Направления.СоздатьЭлемент();    				
			//Зона.Наименование = ТЗ[итер].ВнутрирегиональнаяЗона;
			//Зона.Записать(); 
			Сообщить("Не заполенено строка "+ ИтерСооб +" столбец Зона");
			Продолжить;
		КонецЕсли; 
		Зона = Справочники.ES_ВнутрирегиональнаяЗона.НайтиПоНаименованию(СтрокаЗона);  
		
		
		Если НЕ ЗначениеЗаполнено(ТЗ[итер].ОбслуживаемыйНаселенныйПункт)тогда
			Сообщить("Не заполенено строка "+ ИтерСооб + " столбец Населенный пункт");
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТЗ[итер].Регион_республика_Край_Область_)тогда
			Сообщить("Не заполенено строка "+ ИтерСооб +" столбец Регион");
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТЗ[итер].ГлобальныйТерминал_ТерминалПриписки_тюковки_)тогда
			Сообщить("Не заполенено строка "+ ИтерСооб +" столбец Терминал");
			Продолжить;
		КонецЕсли; 
		НовЗапись = Набор.Добавить();
		НовЗапись.НасленныйПункт = СтрЗаменить(ТЗ[итер].ОбслуживаемыйНаселенныйПункт,"'","");
		НовЗапись.Регион= СтрЗаменить(ТЗ[итер].Регион_республика_Край_Область_,"'","");
		НовЗапись.Терминал = СтрЗаменить(ТЗ[итер].ГлобальныйТерминал_ТерминалПриписки_тюковки_,"'","");
		НовЗапись.Зона = Зона; 		          
		Набор.Записать();   			
	КонецЦикла; 
	Элементы.Список.Обновить();
	Сообщить("Документ успешно загружен");
КонецПроцедуры 


&НаКлиенте
Процедура Загрузить(Команда)
	ПутьКФайлу = "";
	АдресФайлаДанных= "";
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = "(*.xls;*xlsx;*xlsb)| *.xls;*xlsx;*xlsb"; 
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбораФайла.ВыбранныеФайлы[0];
		Розширение = Прав(ПутьКФайлу,СтрДлина(ПутьКФайлу)-Найти(ПутьКФайлу,"."));
		АдресФайлаДанных = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу));
		//Мы помещаем объект формы в переменную,
		//так как должны передать её в процедуру на сервере,
		//где нельзя изменять объект формы, зато можно править переменную содержащую его
		ЗагрузитьНаСервере(АдресФайлаДанных,Розширение);		
	КонецЕсли;

КонецПроцедуры

Функция ПрочитатьТабличныйДокумент(ТЗ = Неопределено, ТабДок = Неопределено, НомерПервойСтроки = 1, НомерПервойКолонки = 1, ВсегоСтрок = 0, ВсегоКолонок = 0) Экспорт
	
	Построитель = Новый ПостроительЗапроса; 	
	
	Область = ТабДок.Область(НомерПервойСтроки,НомерПервойКолонки,ВсегоСтрок,ВсегоКолонок);
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Область);
    Построитель.Выполнить();
    ТЗ = Построитель.Результат.Выгрузить();
	Возврат ТЗ;
КонецФункции


Функция ПрочитатьЛистExcel(ТЗ = Неопределено, ЛистЭксель = Неопределено, НомерПервойСтроки = 1, НомерПервойКолонки = 1, ВсегоСтрок = 0, ВсегоКолонок = 0) Экспорт
	
	Если ВсегоСтрок = 0 Тогда
		ВсегоСтрок = ЛистЭксель.Cells.SpecialCells(11).Row;
	КонецЕсли;
	Если ВсегоКолонок = 0 Тогда
		ВсегоКолонок = ЛистЭксель.Cells.SpecialCells(11).Column;
	КонецЕсли;
	Если ТЗ = Неопределено Тогда
		ТЗ =  Новый ТаблицаЗначений;
		Для Счетчик = 1 По ВсегоКолонок Цикл
			ТЗ.Колонки.Добавить("Колонка"+Счетчик, Новый ОписаниеТипов("Строка"));
		КонецЦикла;
	КонецЕсли;
	Для Счетчик = НомерПервойСтроки По ВсегоСтрок Цикл
		НоваяСтрока = ТЗ.Добавить();
	КонецЦикла;
	
	Область = ЛистЭксель.Range(ЛистЭксель.Cells(НомерПервойСтроки,НомерПервойКолонки), ЛистЭксель.Cells(ВсегоСтрок,ВсегоКолонок));
	Данные = Область.Value.Выгрузить();
	
	Для Счетчик = 0 По ВсегоКолонок-1 Цикл
		ТЗ.ЗагрузитьКолонку(Данные[Счетчик], Счетчик);
	КонецЦикла;
	ЛистЭксель = Неопределено;
	Возврат ТЗ;
КонецФункции  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ЭР Несторук С.И. 10.04.2019 9:32:27 {
	ES_БиллингКлиент.ПроверитьДоступностьСервисаDelans(Отказ);
	//}ЭР Несторук С.И.

КонецПроцедуры
